# PANDAS

### Pandas Series
######  --->>Built for economic and financial work
######  --->>Written for data manipulation and data analysis

In [4]:
"""
create pandas series
"""
import pandas as pd
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
series = pd.Series([1,2,3,4,5])
type(series)

pandas.core.series.Series

In [6]:
series.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
series.dtype

dtype('int64')

In [9]:
series.size

5

In [10]:
series.ndim

1

In [11]:
series.values

array([1, 2, 3, 4, 5], dtype=int64)

In [12]:
series.head

<bound method NDFrame.head of 0    1
1    2
2    3
3    4
4    5
dtype: int64>

In [13]:
series.head(3)

0    1
1    2
2    3
dtype: int64

In [14]:
series.tail

<bound method NDFrame.tail of 0    1
1    2
2    3
3    4
4    5
dtype: int64>

In [15]:
series.tail(2)

3    4
4    5
dtype: int64

In [17]:
#index naming
pd.Series([99,22,332,94,5], index=[1,5,9,4,3])

1     99
5     22
9    332
4     94
3      5
dtype: int64

In [20]:
pd.Series([99,22,332,94,5], index=["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [23]:
#create list with dictionary
dictionary = pd.Series({"reg":10, "log":11, "cart":12})
series = pd.Series(dictionary)
series

reg     10
log     11
cart    12
dtype: int64

In [24]:
# combining two series
pd.concat([series,series])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [25]:
# element query
"reg" in series

True

In [26]:
"aa" in series

False

## Pandas DataFrame
###### --->>is pandas data structure

In [30]:
#create pandas dataframe
l = [1,2,39,67,90]
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [36]:
import numpy as np
np.arange(1,10).reshape([3,3])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [37]:
pd.DataFrame(m,columns=["data1","data2","data3"])

   data1  data2  data3
0      1      2      3
1      4      5      6
2      7      8      9

In [41]:
# df naming
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [47]:
df.columns = ("dg1","dg2","dg3")
df

   dg1  dg2  dg3
0    1    2    3
1    4    5    6
2    7    8    9

In [50]:
"""
Element operations
"""
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)
dictionary = {"var1":s1,"var2":s2,"var3":s3}
dictionary

{'var1': array([1, 0, 4, 8, 2]),
 'var2': array([2, 3, 4, 9, 8]),
 'var3': array([6, 4, 4, 6, 2])}

In [52]:
df = pd.DataFrame(dictionary)
df

   var1  var2  var3
0     1     2     6
1     0     3     4
2     4     4     4
3     8     9     6
4     2     8     2

In [53]:
df[0:1]

   var1  var2  var3
0     1     2     6

In [54]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [55]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     1     2     6
b     0     3     4
c     4     4     4
d     8     9     6
e     2     8     2

In [57]:
df["c":"e"]

   var1  var2  var3
c     4     4     4
d     8     9     6
e     2     8     2

In [58]:
# deletion
df.drop ("a",axis=0)
# temporary delete

   var1  var2  var3
b     0     3     4
c     4     4     4
d     8     9     6
e     2     8     2

In [64]:
df.drop("b",axis=0, inplace=True)
df
#permanently delete

   var1  var2  var3
c     4     4     4
d     8     9     6
e     2     8     2

In [68]:
#fancy
l = ["c","e"]
df.drop(l,axis=0)

   var1  var2  var3
d     8     9     6

In [69]:
df

   var1  var2  var3
c     4     4     4
d     8     9     6
e     2     8     2

In [70]:
# for variable
"var1" in df

True

In [72]:
l = ["var1","var2","var3"]
for i in l:
    print(i in df)

True
True
True

In [76]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
c     4     4     4  1.000000
d     8     9     6  0.888889
e     2     8     2  0.250000

In [77]:
# deletion variable
df.drop("var4",axis=1)

   var1  var2  var3
c     4     4     4
d     8     9     6
e     2     8     2

In [78]:
df

   var1  var2  var3      var4
c     4     4     4  1.000000
d     8     9     6  0.888889
e     2     8     2  0.250000

In [85]:
"""
loc && iloc
"""
m = np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    22     7    23
1    24    10    25
2     8    16     5
3    12     7     4
4     2    25    27
5    19    20    27
6     1     9    20
7     5    17    19
8    12    14     8
9    25    19     2

In [87]:
df.loc[0:3]

   var1  var2  var3
0    22     7    23
1    24    10    25
2     8    16     5
3    12     7     4

In [88]:
df.iloc[0:3]

   var1  var2  var3
0    22     7    23
1    24    10    25
2     8    16     5

In [89]:
df.iloc[0,0]

22

In [90]:
df.iloc[:3,:2]

   var1  var2
0    22     7
1    24    10
2     8    16

In [91]:
df.loc[0:3,"var3"]

0    23
1    25
2     5
3     4
Name: var3, dtype: int32

In [ ]:
df.iloc[0:3,"var3"]   # errors do not use for "var3"

In [93]:
df.iloc[0:3]["var3"]

0    23
1    25
2     5
Name: var3, dtype: int32

In [94]:
"""
conditional element operations
"""
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    11     5    26
1    21     1     7
2     9     6    22
3     7    25     7
4    22    28    28
5     7    23    28
6    22    11    10
7    24     6    14
8    25     6    12
9     8    11     5

In [96]:
df["var1"]

0    11
1    21
2     9
3     7
4    22
5     7
6    22
7    24
8    25
9     8
Name: var1, dtype: int32

In [97]:
df["var1"][0:2]

0    11
1    21
Name: var1, dtype: int32

In [98]:
df[0:2]

   var1  var2  var3
0    11     5    26
1    21     1     7

In [ ]:
df[0:2]["var1","var2"]    # errorss

In [100]:
df[0:2][["var1","var2"]]

   var1  var2
0    11     5
1    21     1

In [102]:
df.var1

0    11
1    21
2     9
3     7
4    22
5     7
6    22
7    24
8    25
9     8
Name: var1, dtype: int32

In [106]:
df[df.var1 > 10]["var1"]

0    11
1    21
4    22
6    22
7    24
8    25
Name: var1, dtype: int32

In [110]:
df[df.var1 > 10]

   var1  var2  var3
0    11     5    26
1    21     1     7
4    22    28    28
6    22    11    10
7    24     6    14
8    25     6    12

In [114]:
df[(df.var1 > 1) & (df.var3 < 10)]

   var1  var2  var3
1    21     1     7
3     7    25     7
9     8    11     5

In [ ]:
df[(df.var1 > 15), ["var1","var2"]]    # error

In [115]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    21     1
4    22    28
6    22    11
7    24     6
8    25     6

In [118]:
df[(df.var1 > 15)][["var2","var3"]]

   var2  var3
1     1     7
4    28    28
6    11    10
7     6    14
8     6    12

In [120]:
"""
merge operations
"""
m = np.random.randint(1,30,size=(5,3))
df1=pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    22    29    17
1    27    11    14
2    10     4    18
3     7     3    20
4    22    22     3

In [122]:
df2 = df1 + 99
df2

   var1  var2  var3
0   121   128   116
1   126   110   113
2   109   103   117
3   106   102   119
4   121   121   102

In [123]:
pd.concat([df1,df2])

   var1  var2  var3
0    22    29    17
1    27    11    14
2    10     4    18
3     7     3    20
4    22    22     3
0   121   128   116
1   126   110   113
2   109   103   117
3   106   102   119
4   121   121   102

In [128]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0    22    29    17
1    27    11    14
2    10     4    18
3     7     3    20
4    22    22     3
5   121   128   116
6   126   110   113
7   109   103   117
8   106   102   119
9   121   121   102

In [129]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [131]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [132]:
df2.columns = ["var1","var2","deg3"]

In [133]:
df1

   var1  var2  var3
0    22    29    17
1    27    11    14
2    10     4    18
3     7     3    20
4    22    22     3

In [134]:
df2

   var1  var2  deg3
0   121   128   116
1   126   110   113
2   109   103   117
3   106   102   119
4   121   121   102

In [135]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    22    29  17.0    NaN
1    27    11  14.0    NaN
2    10     4  18.0    NaN
3     7     3  20.0    NaN
4    22    22   3.0    NaN
0   121   128   NaN  116.0
1   126   110   NaN  113.0
2   109   103   NaN  117.0
3   106   102   NaN  119.0
4   121   121   NaN  102.0

In [137]:
pd.concat([df1,df2],join="inner")

   var1  var2
0    22    29
1    27    11
2    10     4
3     7     3
4    22    22
0   121   128
1   126   110
2   109   103
3   106   102
4   121   121

In [142]:
df3 = pd.concat([df1, df2], axis=1)
df3 = df3.reindex(df1.index)
df3

   var1  var2  var3  var1  var2  deg3
0    22    29    17   121   128   116
1    27    11    14   126   110   113
2    10     4    18   109   103   117
3     7     3    20   106   102   119
4    22    22     3   121   121   102

In [143]:
df4 = pd.concat([df1, df2], axis=1)
df4 = df3.reindex(df2.index)
df4

   var1  var2  var3  var1  var2  deg3
0    22    29    17   121   128   116
1    27    11    14   126   110   113
2    10     4    18   109   103   117
3     7     3    20   106   102   119
4    22    22     3   121   121   102

In [ ]:
"""
Advanced join operations
"""

In [148]:
# one-to-one merge
df1 = pd.DataFrame({'employees':['Ali','Veli','Ayse','Fatma'],
                   'group':['account','engineer','engineer','HR']})
df1

  employees     group
0       Ali   account
1      Veli  engineer
2      Ayse  engineer
3     Fatma        HR

In [149]:
df2 = pd.DataFrame({'employees':['Ali','Veli','Ayse','Fatma'],
                   'startDate':[2010,2009,2014,2019]})
df2

  employees  startDate
0       Ali       2010
1      Veli       2009
2      Ayse       2014
3     Fatma       2019

In [150]:
pd.merge(df1,df2)

  employees     group  startDate
0       Ali   account       2010
1      Veli  engineer       2009
2      Ayse  engineer       2014
3     Fatma        HR       2019

In [151]:
pd.merge(df1,df2,on='employees')

  employees     group  startDate
0       Ali   account       2010
1      Veli  engineer       2009
2      Ayse  engineer       2014
3     Fatma        HR       2019

In [152]:
# many-to-one merge
df3 = pd.merge(df1,df2)
df3

  employees     group  startDate
0       Ali   account       2010
1      Veli  engineer       2009
2      Ayse  engineer       2014
3     Fatma        HR       2019

In [153]:
df4 = pd.DataFrame({'group':['account','engineer','HR'],
                   'director':['caner','mustafa','berkcan']})
df4

      group director
0   account    caner
1  engineer  mustafa
2        HR  berkcan

In [154]:
pd.merge(df3,df4)

  employees     group  startDate director
0       Ali   account       2010    caner
1      Veli  engineer       2009  mustafa
2      Ayse  engineer       2014  mustafa
3     Fatma        HR       2019  berkcan

In [157]:
# many-to-many merge
df5=pd.DataFrame({'group':['account','account','engineer','engineer','HR','HR'],
                          'ability':['math','excel','Code','linux','excel','manager']})
df5

      group  ability
0   account     math
1   account    excel
2  engineer     Code
3  engineer    linux
4        HR    excel
5        HR  manager

In [158]:
df1

  employees     group
0       Ali   account
1      Veli  engineer
2      Ayse  engineer
3     Fatma        HR

In [159]:
pd.merge(df1,df5)

  employees     group  ability
0       Ali   account     math
1       Ali   account    excel
2      Veli  engineer     Code
3      Veli  engineer    linux
4      Ayse  engineer     Code
5      Ayse  engineer    linux
6     Fatma        HR    excel
7     Fatma        HR  manager

## Grouping & Aggregation Operation

###### Simple aggregation operations
"""
---count()
---first()
---last()
---mean()
---median()
---min()
---max()
---std()
---var()
---sum()
"""

In [169]:
import seaborn as sns
df = sns.load_dataset("planets")

In [170]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [172]:
df.shape

(1035, 6)

In [173]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [174]:
df["mass"].mean()

2.6381605847953233

In [175]:
df["mass"].count()

513

In [176]:
df["mass"].min()

0.0036

In [177]:
df["mass"].max()

25.0

In [178]:
df["mass"].sum()

1353.37638

In [179]:
df["mass"].std()    #standard deviation

3.8186166509616046

In [180]:
df["mass"].var()    # variance

14.58183312700122

In [181]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [182]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [183]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [187]:
"""
Grouping
"""
df = pd.DataFrame({'group':['A','B','C','A','B','C'],
                  'data':[10,11,52,23,43,55]},columns=['group','data'])
df

  group  data
0     A    10
1     B    11
2     C    52
3     A    23
4     B    43
5     C    55

In [188]:
df.groupby("group")

In [189]:
df.groupby("group").mean()

       data
group
A      16.5
B      27.0
C      53.5

In [190]:
df.groupby("group").sum()

       data
group
A        33
B        54
C       107

In [191]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [192]:
df.groupby("method")

In [193]:
df.groupby("method")["orbital_period"]

In [194]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [195]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [196]:
df.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [200]:
"""
Aggregate
"""
df = pd.DataFrame({'group':['A','B','C','A','B','C'],
                  'var1':[10,23,33,22,11,99],
                  'var2':[100,253,333,262,111,969]},
                 columns=['group','var1','var2'])
df

  group  var1  var2
0     A    10   100
1     B    23   253
2     C    33   333
3     A    22   262
4     B    11   111
5     C    99   969

In [202]:
df.groupby("group")

In [203]:
df.groupby("group").mean()

       var1  var2
group
A        16   181
B        17   182
C        66   651

In [204]:
df.groupby("group").aggregate(["min",np.median,max])

      var1            var2
       min median max  min median  max
group
A       10     16  22  100    181  262
B       11     17  23  111    182  253
C       33     66  99  333    651  969

In [206]:
df.groupby("group").aggregate({"var1":min,"var2":max})

       var1  var2
group
A        10   262
B        11   253
C        33   969

In [207]:
"""
filter
"""
def filter_func(x):
    return x["var1"].std()>9
df.groupby("group").filter(filter_func)

  group  var1  var2
2     C    33   333
5     C    99   969

In [208]:
df.groupby("group").std()

            var1        var2
group
A       8.485281  114.551299
B       8.485281  100.409163
C      46.669048  449.719913

In [221]:
"""
transfrom
"""
df

  group  var1  var2
0     A    10   100
1     B    23   253
2     C    33   333
3     A    22   262
4     B    11   111
5     C    99   969

In [222]:
df['var1']*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [223]:
df.transform(lambda x: x-x.mean())

  group  var1   var2
0   NaN -23.0 -238.0
1   NaN -10.0  -85.0
2   NaN   0.0   -5.0
3   NaN -11.0  -76.0
4   NaN -22.0 -227.0
5   NaN  66.0  631.0

In [ ]:
df[:,1:2]           # error

In [226]:
df.iloc[:,1:2]

   var1
0    10
1    23
2    33
3    22
4    11
5    99

In [ ]:
df_a.transform(lambda x:x-x.mean())

In [ ]:
df_a.transform(lambda x: x-x.mean()) / std()

In [ ]:
"""
apply
"""
df.apply(np.sum)
df.apply(np.mean)

In [ ]:
df.groupby("group").apply(np.sum)

In [ ]:
df.groupby("group").apply(np.mean)

In [ ]:
"""
Pivot tables
"""
~~groupby

In [229]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [230]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [231]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [232]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [233]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [236]:
# pivot
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
"""
Read external data
"""

In [ ]:
#reading csv
pd.read.csv("reading_data/example.csv")
pd.read.csv("reading_data/example.csv",sep=";")

In [ ]:
#reading txt
pd.read_csv("reading_data/sampletxt.txt")
pd.read_excel("reading_data/sampletxt.xlsv")
df = pd.read_excel("reading_data/sampletxt.xlsv")